WITH base AS (
 SELECT
    UPPER("חברה") as source_db,
    "תאריך בקרה",
    "פרויקט",
    "תאור פרויקט",
    "תת פרק",
    "תאור תת פרק" ,
    "משאב",
    "תאור משאב",
    "סוג תעודה",
    "תאור תעודה",
    "מס' ספק",
    "שם ספק",
    "מספר תעודה",

    CASE 
    -- פורמט חודש/שנה (05/24, 01/26)
    WHEN REGEXP_COUNT("תאריך/חודש ביצוע", '/') = 1 THEN 
        TO_DATE(
            '01/' || "תאריך/חודש ביצוע",
            'DD/MM/YY'
        )

    -- פורמט מלא יום/חודש/שנה (15/02/24)
    ELSE 
        TO_DATE(
            "תאריך/חודש ביצוע",
            'DD/MM/YY'
        )
    END AS "תאריך/חודש ביצוע",

    "מק'ט",
    "תאור מוצר",
    "כמות בתעודה",
    "יח' מפעל",
    "מחיר יח'",
    "סכום",

    CASE
    WHEN "סוג תעודה" IN ('קבספ', 'חסמ', 'חס', 'חסז', 'חזס')
         AND "משאב" LIKE '1021%'
    THEN "סכום"
    ELSE 0
    END AS "הוצאות בפועל בטון",

    CASE
    WHEN "סוג תעודה" IN ('קבספ', 'חסמ', 'חס', 'חסז', 'חזס')
         AND "משאב" LIKE '1022%'
    THEN "סכום"
    ELSE 0
    END AS "הוצאות בפועל ברזל",


CASE
    WHEN "סוג תעודה" IN ('מ')
    THEN "סכום"
    ELSE 0
END AS "הוצאות בפועל ניהול אתר",

 CASE
    WHEN "סוג תעודה" IN ('פ')
    THEN "סכום"
    ELSE 0
 END AS "הוצאות בפועל ניהול שונות",


 CASE
    WHEN "סוג תעודה" IN ('PPC')
    THEN "סכום"
    ELSE 0
 END AS "הוצאות בפועל קבלנים",

 CASE
    WHEN "סוג תעודה" IN ('קבספ', 'חסמ', 'חס', 'חסז', 'חזס')
         AND "משאב" LIKE '1021%'
    THEN "כמות בתעודה"
    ELSE 0
    END AS "הוצאות בפועל כמות בטון",

    CASE
    WHEN "סוג תעודה" IN ('קבספ', 'חסמ', 'חס', 'חסז', 'חזס')
         AND "משאב" LIKE '1022%'
    THEN "כמות בתעודה"
    ELSE 0
    END AS "הוצאות בפועל כמות ברזל",


CASE
    WHEN "סוג תעודה" IN ('מ')
    THEN "כמות בתעודה"
    ELSE 0
END AS "הוצאות בפועל כמות ניהול אתר",

 CASE
    WHEN "סוג תעודה" IN ('פ')
    THEN "כמות בתעודה"
    ELSE 0
 END AS "הוצאות בפועל כמות ניהול שונות",


 CASE
    WHEN "סוג תעודה" IN ('PPC')
    THEN "כמות בתעודה"
    ELSE 0
 END AS "הוצאות בפועל כמות קבלנים",


 CASE
    WHEN "סוג תעודה" <> 'PPC'
         AND "משאב" = 999999
    THEN 1
    ELSE 0
 END AS Project_Expenses_Exclude_Flag

FROM {{ source('txt', 'PROJECT_ACTUAL_EXPENSES') }}

)


SELECT
    *,

    "סכום"
      - "הוצאות בפועל בטון"
      - "הוצאות בפועל ברזל"
      - "הוצאות בפועל ניהול שונות"
      - "הוצאות בפועל קבלנים"
      - "הוצאות בפועל ניהול אתר"
      AS "הוצאות בפועל רכש"

FROM base