SELECT
    UPPER("חברה") as source_db,
    "תאריך בקרה",
    "פרויקט",
    "תאור פרויקט",
    "תת פרק",
    "תאור תת פרק" ,
    "משאב",
    "תאור משאב",
    "סוג תעודה",
    "תאור תעודה",
    "מס' ספק",
    "שם ספק",
    "מספר תעודה",

    CASE 
    -- פורמט חודש/שנה (05/24, 01/26)
    WHEN REGEXP_COUNT("תאריך/חודש ביצוע", '/') = 1 THEN 
        TO_DATE(
            '01/' || "תאריך/חודש ביצוע",
            'DD/MM/YY'
        )

    -- פורמט מלא יום/חודש/שנה (15/02/24)
    ELSE 
        TO_DATE(
            "תאריך/חודש ביצוע",
            'DD/MM/YY'
        )
    END AS "תאריך/חודש ביצוע",

    "מק'ט",
    "תאור מוצר",
    "כמות בתעודה",
    "יח' מפעל",
    "מחיר יח'",
    "סכום"
FROM {{ source('txt', 'PROJECT_ACTUAL_EXPENSES') }}