SELECT
    a.source_db,
    a."תאריך בקרה",
    a."פרויקט",
    a."תאור פרויקט",
    a."תת פרק",
    a."תאור תת פרק",
    a."משאב",
    a."תאור משאב",
    a."סוג תעודה",
    a."תאור תעודה",
    a."מס' ספק",
    a."שם ספק",
    a."מספר תעודה",
    a."תאריך/חודש ביצוע" AS "Date",
    a."מק'ט",
    a."תאור מוצר",
    a."כמות בתעודה",
    a."יח' מפעל",
    a."מחיר יח'",
    a."סכום",
    p.projtypedes AS "סוג פרויקט אחרי סינון"
    

FROM {{ ref('PROJECT_ACTUAL_EXPENSES_STG') }} a

{{ join_valid_projects('a."פרויקט"', 'a.source_db') }}


