SELECT
    a.SOURCE_DB  as "חברה",
    a."תאריך בקרה",
    a."פרויקט" AS "מספר פרויקט",
    a."תאור פרויקט",
    a."תת פרק",
    a."תאור תת פרק",
    a."משאב",
    a."תאור משאב",
    a."סוג תעודה",
    a."תאור תעודה",
    a."מס' ספק",
    a."שם ספק",
    a."מספר תעודה",
    a."תאריך/חודש ביצוע" AS "Date",
    a."מק'ט",
    a."תאור מוצר",
    a."כמות בתעודה",
    a."יח' מפעל",
    a."מחיר יח'",
    a."סכום",
    a."הוצאות בפועל בטון",
    a."הוצאות בפועל ברזל",
    a."הוצאות בפועל ניהול שונות",
    a."הוצאות בפועל קבלנים",
    a."הוצאות בפועל ניהול אתר",
    a."הוצאות בפועל רכש",
    a."הוצאות בפועל כמות בטון",
    a."הוצאות בפועל כמות ברזל",
    a."הוצאות בפועל כמות ניהול שונות",
    a."הוצאות בפועל כמות קבלנים",
    a."הוצאות בפועל כמות ניהול אתר",
    a.Project_Expenses_Exclude_Flag,
    p.projtypedes AS "סוג פרויקט אחרי סינון"
    

FROM {{ ref('PROJECT_ACTUAL_EXPENSES_STG') }} a

{{ join_valid_projects('a."פרויקט"', 'a.source_db') }}


